Catalogs/МашиночитаемыеДоверенностиКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>МашиночитаемыеДоверенностиКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>XMLфайлМЧД</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Верна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузкиИзРеестра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтзыва</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания в ИБ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доверитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверительИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВРеестреФНС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесколькоПредставителей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отозвана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолномочияОграничены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СовместныеПолномочия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВРеестреФНС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыМашиночитаемойДоверенностиВРеестреФНС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибкиПроверкиМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПодпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННДоверителяРодительскойДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРодительскойДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСкриптПроверкиПолномочий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/МашиночитаемыеДоверенностиВызовСервера/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ПроверкаПодписи

// См. МашиночитаемыеДоверенности.ЗаписатьРезультатПроверкиПолномочий
Функция ЗаписатьРезультатПроверкиПолномочий(Знач ДанныеПроверки) Экспорт;
	Возврат МашиночитаемыеДоверенности.ЗаписатьРезультатПроверкиПолномочий(ДанныеПроверки);
КонецФункции	

#КонецОбласти

// Выгрузить данные доверенности в строку XML.
// 
// Параметры:
//  СправочникСсылка - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
// 
// Возвращаемое значение:
//  См. МашиночитаемыеДоверенности.ВыгрузитьXML
Функция ВыгрузитьXML(Знач СправочникСсылка) Экспорт
	
	Возврат МашиночитаемыеДоверенности.ВыгрузитьXML(СправочникСсылка);
	
КонецФункции

// См. Справочники.МашиночитаемыеДоверенностиОрганизаций.ЗагрузитьЭлементИзФайлаОбмена
// Загружает элемент справочника из файла обмена.
// 
// Параметры:
//  ДанныеДляЗагрузки - см. МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеДляЗагрузкиМЧД
//  ТребуетсяПроверкаМЧДНаКлиенте - Булево - Флаг устанавливается в Истина, 
//                                             если отсутствует возможность проверить подпись МЧД на сервере 
//                                             (в настройках установлена проверка подписи на клиенте) 
//                                             и необходимо выполнить проверку на клиенте.
//  ОбновлятьСуществующий - Булево - Если Истина, то будет обновлен существующий элемент, если он найден.
//  ЭтоДоверенностьКонтрагента - Булево - Истина, если вызывается из формы справочника МашиночитаемыеДоверенностиКонтрагентов
//  ДополнительныеСведения - Неопределено, Структура - Если переданы, то будут заполнены в элементе справочника.
// 
// Возвращаемое значение:
//  Структура - Результат загрузки:
//   * Выполнено - Булево - Признак успешности выполнения загрузки.
//   * Ссылка - Неопределено, СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций - Ссылка на элемент справочника.
//   * Ошибка - Строка - Текст ошибки, если не удалось загрузить элемент.
//   * ТребуетсяПроверкаМЧДНаКлиенте - Булево
//
Функция ЗагрузитьМЧД(Знач ДанныеДляЗагрузки, ТребуетсяПроверкаМЧДНаКлиенте, Знач ОбновлятьСуществующий = Ложь,
	Знач ЭтоДоверенностьКонтрагента = Ложь, Знач ДополнительныеСведения = Неопределено) Экспорт
	
	Если ЭтоДоверенностьКонтрагента Тогда
		Возврат Справочники.МашиночитаемыеДоверенностиКонтрагентов.ЗагрузитьЭлементИзФайлаОбмена(
			ДанныеДляЗагрузки, ТребуетсяПроверкаМЧДНаКлиенте, ОбновлятьСуществующий, ДополнительныеСведения);
	КонецЕсли;
	
	Возврат Справочники.МашиночитаемыеДоверенностиОрганизаций.ЗагрузитьЭлементИзФайлаОбмена(
		ДанныеДляЗагрузки, ТребуетсяПроверкаМЧДНаКлиенте, ОбновлятьСуществующий, ДополнительныеСведения);
			
КонецФункции

// См. МашиночитаемыеДоверенности.ВыгрузитьЗаявлениеНаОтменуМЧД
Функция ВыгрузитьЗаявлениеНаОтменуМЧД(Знач НомерДоверенности, Знач ПричинаОтмены) Экспорт
	
	Возврат МашиночитаемыеДоверенности.ВыгрузитьЗаявлениеНаОтменуМЧД(НомерДоверенности, ПричинаОтмены);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ПолучитьНомерМЧД
Функция ПолучитьНомерМЧД(Знач ТокенДоступа = "") Экспорт
	
	Возврат МашиночитаемыеДоверенности.ПолучитьНомерМЧД(ТокенДоступа);
	
КонецФункции

// Регистрирует МЧД на сервере МЧД.
// 
// Параметры:
//  СсылкаНаДоверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//  ДанныеВыгрузки - ДвоичныеДанные - Данные выгрузки
//  ДанныеПодписи - ДвоичныеДанные - Данные подписи
//  ТокенДоступа - Строка - Токен доступа
//  НомерДоверенности - Строка - Номер доверенности
// 
// Возвращаемое значение:
//  См. МашиночитаемыеДоверенности.ЗарегистрироватьМЧД
Функция ЗарегистрироватьМЧД(Знач СсылкаНаДоверенность, ДанныеВыгрузки, Знач ДанныеПодписи, Знач ТокенДоступа = "",
	Знач НомерДоверенности = "") Экспорт
	
	ИмяФайлаВыгрузки = Справочники.МашиночитаемыеДоверенностиОрганизаций.ПолучитьИмяФайлаМЧД(СсылкаНаДоверенность);
	Возврат МашиночитаемыеДоверенности.ЗарегистрироватьМЧД(ИмяФайлаВыгрузки, ДанныеВыгрузки, ДанныеПодписи,
		ТокенДоступа, НомерДоверенности, СсылкаНаДоверенность);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ПолучитьСтатусТранзакцииМЧД
Функция ПолучитьСтатусТранзакцииМЧД(Знач ИдентификаторТранзакции,
	Знач ТокенДоступа = "", Знач НомерДоверенности = "") Экспорт
	
	Возврат МашиночитаемыеДоверенности.ПолучитьСтатусТранзакцииМЧД(ИдентификаторТранзакции, ТокенДоступа,
		НомерДоверенности);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ПолучитьСведенияДоверенностиНаСервереМЧД
Функция ПолучитьСведенияДоверенностиНаСервереМЧД(Знач НомерДоверенности,
	Знач ИННДоверителя, Знач ТокенДоступа = "") Экспорт
	
	Возврат МашиночитаемыеДоверенности.ПолучитьСведенияДоверенностиНаСервереМЧД(
		НомерДоверенности, ИННДоверителя, ТокенДоступа);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ПолучитьЧастичныеДанныеДоверенностиНаСервереМЧД
Функция ПолучитьЧастичныеДанныеДоверенностиНаСервереМЧД(Знач НомерДоверенности, Знач ТокенДоступа = "") Экспорт
	
	Возврат МашиночитаемыеДоверенности.ПолучитьЧастичныеДанныеДоверенностиНаСервереМЧД(НомерДоверенности, ТокенДоступа);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ОтменитьМЧД
Функция ОтменитьМЧД(Знач ИмяФайлаВыгрузки, Знач ДанныеВыгрузки, Знач ДанныеПодписи, Знач ТокенДоступа = "",
	Знач НомерДоверенности = "", Знач СсылкаНаДоверенность = Неопределено) Экспорт
	
	Возврат МашиночитаемыеДоверенности.ОтменитьМЧД(ИмяФайлаВыгрузки, ДанныеВыгрузки, ДанныеПодписи, ТокенДоступа,
		НомерДоверенности, СсылкаНаДоверенность);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ПолучитьНомераДоверенностей
Функция ПолучитьНомераДоверенностей(Знач Доверенности) Экспорт
	
	Возврат МашиночитаемыеДоверенности.ПолучитьНомераДоверенностей(Доверенности);
	
КонецФункции

// См. Справочники.МашиночитаемыеДоверенностиКонтрагентов.ЗагрузитьМЧДИзФайла
Функция ЗагрузитьМЧДКонтрагентаИзФайла(Знач ДанныеФайла) Экспорт
	
	Возврат Справочники.МашиночитаемыеДоверенностиКонтрагентов.ЗагрузитьМЧДИзФайла(ДанныеФайла);
	
КонецФункции

// См. Справочники.МашиночитаемыеДоверенностиОрганизаций.ЗагрузитьМЧДИзФайла
Функция ЗагрузитьМЧДОрганизацииИзФайла(Знач ДанныеФайла) Экспорт
	
	Возврат Справочники.МашиночитаемыеДоверенностиОрганизаций.ЗагрузитьМЧДИзФайла(ДанныеФайла);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ОтразитьРезультатПроверкиМЧД
Процедура ОтразитьРезультатПроверкиМЧД(Знач МЧД, Знач Верна, Знач ТекстОшибки) Экспорт
	
	МашиночитаемыеДоверенности.ОтразитьРезультатПроверкиМЧД(МЧД, Верна, ТекстОшибки);
	
КонецПроцедуры

// См. МашиночитаемыеДоверенности.ДанныеФайлаДоверенностиИПодписи
Функция ДанныеФайлаДоверенностиИПодписи(Знач МЧД) Экспорт
	
	Возврат МашиночитаемыеДоверенности.ДанныеФайлаДоверенностиИПодписи(МЧД);
	
КонецФункции

// См. МашиночитаемыеДоверенности.ВыполнитьДействияПослеПодписания
Процедура ВыполнитьДействияПослеПодписания(Знач Доверенность, Знач ДанныеВыгрузки,
	Знач СвойстваПодписи, ТребуетсяПроверкаМЧДНаКлиенте = Ложь) Экспорт
	
	МашиночитаемыеДоверенности.ВыполнитьДействияПослеПодписания(Доверенность, ДанныеВыгрузки,
		СвойстваПодписи, ТребуетсяПроверкаМЧДНаКлиенте);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. МашиночитаемыеДоверенности.РезультатПроверкиДоверенности
Функция РезультатПроверкиДоверенности(ДанныеДоверенности, РезультатПроверкиПодписи, КонтекстДиагностики) Экспорт
	
	Возврат МашиночитаемыеДоверенности.РезультатПроверкиДоверенности(ДанныеДоверенности, РезультатПроверкиПодписи,
		КонтекстДиагностики);
	
КонецФункции

// См. Справочники.МашиночитаемыеДоверенностиОрганизаций.ДатаОтзываДоверенности
Функция ДатаОтзыва(НомерДоверенности, ДоверительЮЛ_ИНН, ДоверительФЛ_ИНН, ТокенДоступа) Экспорт
	
	Возврат Справочники.МашиночитаемыеДоверенностиОрганизаций.ДатаОтзываДоверенности(НомерДоверенности,
		ДоверительЮЛ_ИНН, ДоверительФЛ_ИНН, ТокенДоступа);
	
КонецФункции

#КонецОбласти
